Revit 2027 API
SingleServerService.SetActiveServer Method
Overload List
Name | Description
SetActiveServer(Guid) |  Set an active server applicable application-wide for the service.
SetActiveServer(Guid, Document) |  Change the active server for a specific document.
Top
See Also
Reference
SingleServerService Class
Autodesk.Revit.DB.ExternalService Namespace